/*
Дано натуральне число n, дійсні числа а, b (а ≠ b). 
Отримати послідовність r1, r2, ... rn, де ri = a + i * h, h = (b – a)/n.
*/

#include <iostream>
using namespace std;

int main() {
    // Оголошення змінних
    int n;
    double a, b, h, r;

    cout << "Введіть натуральне число n (кількість кроків): ";
    cin >> n;
    // Блок перевірки введення n
    do {
        cout << "Введіть число a: ";
        cin >> a;
        cout << "Введіть число b: ";
        cin >> b;

        // Перевірка умови
        if (a == b) {
            cout << ">>> Помилка: числа a і b не можуть бути рівними! Спробуйте ще раз." << endl;
            cout << "-----------------------" << endl;
        }

    } while (a == b);
    
    // Обчислення кроку h
    h = (b - a) / n;
    
    cout << "-----------------------" << endl;
    cout << "Крок h = " << h << endl;
    cout << "Послідовність:" << endl;

    // Цикл для обчислення кожного члена послідовності
    for (int i = 1; i <= n; i++) {
        r = a + i * h;
        // Виведення результату на кожному кроці
        cout << "r[" << i << "] = " << r << endl;
    }
    cout << "-----------------------" << endl;

    return 0;
}
